app/Models/ModelPenjualan.php

    public function AllProduk()
    {
        return $this->db->table('tbl_produk')
             ->join('tbl_kategori','tbl_kategori.id_kategori=tbl_produk.id_kategori')
             ->join('tbl_satuan','tbl_satuan.id_satuan=tbl_produk.id_satuan')
             ->orderBy('id_produk', 'DESC')
             ->where('stok > 0')
             ->get()
             ->getResultArray();
---
SELECT *
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`=`tbl_produk`.`id_kategori`
JOIN `tbl_satuan` ON `tbl_satuan`.`id_satuan`=`tbl_produk`.`id_satuan`
WHERE `stok` >0
ORDER BY `id_produk` DESC